{
  "architectures": [
    "SiglipModel"
  ],
  "initializer_factor": 1.0,
  "model_type": "siglip",
  "text_config": {
    "hidden_size": 768,
    "intermediate_size": 3072,
    "model_type": "siglip_text_model",
    "num_attention_heads": 12,
    "vocab_size": 32000
  },
  "torch_dtype": "float32",
  "transformers_version": "4.37.0.dev0",
  "vision_config": {
    "model_type": "siglip_vision_model",
    "patch_size": 16
  }
}
